{"text": "Oh this one’s going to be controversial"}
{"text": "i personally and with absolute bias think Goff is better than Love but can also understand that Goff has a much better supporting cast, which i won’t necessarily complain about"}
{"text": "Well, no offense, but that's kind of Keenan Allen's MO, missing time. Yes, it's not as if he misses games every season, but you accept that he will get injured with him. \n\nTell us about those Love rankings, please."}
{"text": "Jordan loves improvement was good. Ahead of qbs like Goff good? Lolno"}
{"text": "I love Quincy so much. Absolute missile"}
{"text": "Love > Goff is all that I'll take away from this list"}
{"text": "I disagree. That's all."}
{"text": "I love spending my time arguing with random people in the internet why I don't agree with their rankings. \n\nHere we go AgAaaAiIiiNNNnN"}
{"text": "Why do only some of them have stats"}
{"text": "Look how they massacred my boy."}
{"text": "I am predicting that this is the lowest Spoon will be ranked for the upcoming years. He was awesome as a rookie in arguably the hardest (non-QB) position to play as a rookie and I think he will only get better"}
{"text": "I mean the Love thing is going to draw the Attention but I’ll start a different gripe. If this is based off what they did last season then I don’t see how you can have Henry ahead of Mostert. Mostert had 9 more touchdowns than Henry. A 4.8 YPC to Mosterts 4.2. Henry has 150 more rushing yards than Mostert but it’s off 70 more touches."}
{"text": "Eat shit, Jonathan Vilma. My dude was blatantly biased while calling the NO vs GB game, and you can hear the disappointment dripping from every pore as he says \"wooooow\" on Love's 2-pt completion."}
{"text": "Obviously Lions fans are going to be upset with this, but Goff and Love had comparable seasons despite Goff having a top 5 WR, one of the best rookie TEs in history, probably the best 1-2 RB punch in the NFL, and probably the best o-line in the NFL. Meanwhile the Packers had the most inexperienced group of pass catchers in NFL history, our best lineman played 1 game, our one veteran playmaker managed 6 full games, and our expected WR1 missed half the season. And yet Love was similarly productive to Goff for the year."}
{"text": "Oh now this is going to be fun"}
{"text": "Witherspoon is the most unique cb this league has seen in a long time."}
{"text": "STOKED to see big Ed getting recognition!"}
{"text": "Goff > Love"}
{"text": "Derrick Henry above Goff? Weird rankings and really highlights some of the bias present in those that were a ‘part’ of this. \n\nNot sure why I assumed these would be good rankings. The population that voted is the same people that have always had large biases for and against certain players. I figured you all were going to do something incredibly advanced with analytics but very disappointed to see how bad these have been so far. \n\nReddit is what it is. A bunch of people who have inflated view of self and aren’t really better than any random average  person in terms of knowledge or know how."}
{"text": "Lol\n\nJordan Love getting glazed crazy like post-2018 Trubisky and post-2015 Bridgewater. The dude can't progress past his first read and he's above a guy who had some of the best stats in 2023 and was a key reason we won the division over Love's team"}
{"text": "The daily dose of offended Lions fans was extra easy to find today"}
{"text": "if dan campbell saw how obsessed you guys were with us instead of your own team he would be very upset"}
{"text": "Reddit mods doing Reddit mod things"}
{"text": "I remember watching the Oliver pick at a shitty Chili's bar and being so angry. I did not see the potential at all.\n\nI'm very glad I was wrong.\n\n  \nAlso, I love Goff the person and for what he's done. But it feels like Detroit is in a KC circa 2016 situation whereas they could draft a guy who actually take them over the top. Quinn Ewers would be the ultimate candidate. Can't picture a better fit."}
{"text": "u/SoDakZak is a salty loser"}
{"text": "I wasn't sure if Love's horrendous midseason would take him out of the list entirely, but slightly better than Goff feels correct."}
{"text": "damn I was hoping we'd have someone here. maybe next year"}
{"text": "I better see Derrick Brown up here soon. Dude set a record for tackles by a D Lineman. He deserves a place on this list."}
{"text": "Honestly surprised that Garrett Wilson wasn't an honorable mention."}
{"text": ">While the varying levels of QB play for the Raiders can possibly be pointed to as a reason for Adams having a “down” year  \n  \nI don't know how the fuck you can even make any argument otherwise..."}
{"text": "Miss Christian Wilkins bad"}
{"text": "feels like 74 is low for Witherspoon, he was remarkably impactful for a rookie corner"}
{"text": "Watching these Christian Wilkins highlights and I can't stop thinking about how ridiculous it is going to be having him and Maxx together on the same team. Their motor/energy/skill combination is going to compliment each other so well. The only thing that is going to stop the Chiefs from trying to make another run, is if Mahomes can survive 2 games against the defense the Raiders have assembled."}
{"text": "Keenan Allen, Los Angeles Chargers?"}
{"text": "Lmao last of these I’ll read. Tae this low makes 0 sense. Play a position fully reliant on QB play and still have an amazing year, while also not having a good play caller/ below avg QB play for the whole year, while still getting doubled every game and producing at normal levels - drop 60 spots on the list\n\nAlso Goff was better than Love. Love was kinda bad for the first half of the year, loved watching him in the second half of the season, but Jared put a pretty solid full season together"}
{"text": ">How many great quarterbacks can Green Bay have in a row? Three, apparently.\n\nWhy not a fourth in 15 years after Love goes to the Jets?"}
{"text": "Jordan Love is the new Trevor Lawrence, change my mind"}
{"text": "lol"}
{"text": "How did we get the 79th best player for a 4th round pick?"}
{"text": "Love and Goff on this list but Hurts not being on it is crazy ngl \n\nLike wild bias from the rankers"}
{"text": "Davante over Keenan is hilarious 💀💀"}
{"text": "Pretty sure they remove outliers, but somebody ranked Jordan Love 12th."}
{"text": "I don’t see why. I think 73 seems just about right for Ed Oliver."}
{"text": "nah. Love's clearly good, the only question is \"how good?\""}
{"text": "I honestly like it. He cleaned up his mistakes quickly, and looked really damn good. He will learn from how the season ended. Feels like his year went under the radar quite a bit."}
{"text": "Oh you damn right it will be! Why is my favorite player of all time not number 1! THIS IS AN OUTRAGE!!"}
{"text": "Doesn't matter.  We're division champs. I can finally say that lol"}
{"text": "While Loves ranking I think is a mix of last seasons performance, along with where he will sit next year, I think by 2024 season's end he will either be a consensus top 5 QB or the end of last season will be just a blip."}
{"text": "Well if Dan Campbell chokes on a kneecap it looks all right."}
{"text": "Lions fans gonna be upsetty spaghetti."}
{"text": "Ok"}
{"text": "They all are, 99% of this sub only watches their team and thinks fantasy numbers can explain everything"}
{"text": "I agree. Love shows lots of promise for sure. I know playoffs aren’t factored into the rankings, but the first half of the season may have been overlooked a little. I remember some games in the first part of the season ending like their playoffs where he just goes for a big play that leads to an int as opposed to…not throwing an interception"}
{"text": "Plus I was surprised to see Love had the second most passing touchdowns last year. His basic stats are impressive."}
{"text": "Yeah, kinda fitting that Goff is gonna end up as the lowest ranked Lion on the list. He's awesome, and I'm very happy with how he's progressed and developed since coming to Detroit, but man, he has got some really awesome players around him too."}
{"text": "I agree but he was really on an awesome pace before he went down. Season has been just sad in general but we have lots to look forward to I guess."}
{"text": "Other than 2022 he's only ever missed at most 2-3 games, usually going at least 13 to 14 games a year"}
{"text": "Second half of the season Love was notably better than Goff, but taking the full season into account it’s arguable. I’d personally lean Love but I know I’m lower on Goff than most"}
{"text": "Why not? Does 400 more yards, less tds, an extra pick, and 1/10th of the rushing production really make Goff a better qb?"}
{"text": "I am livid, not really, but if I could feel anything I would be"}
{"text": "I mean their stats are damn near identical. Wether you have Goff or love higher is your choice, but saying “lol no” is not an accurate way to put this debate"}
{"text": "This part of the list was made solely to get Lions fans and Packers fans to fight each other"}
{"text": "There aren't any defining rules of how to do a writeup in this portion of the rankings, I felt like including some basic stats would complement the short writeup well."}
{"text": "I think Keenan Allen is the only one with stats, because the one doing the writeup included them."}
{"text": "I think Henry > Mostert is based on two things\n\n1. Henry playing with a horrendous supporting cast, including PFF's worst graded offensive line in the league.\n\n2. Achane putting up a much better Y/A than Mostert did on the same team"}
{"text": "I’m inclined to agree. I think if you switched the names the ranking would be flipped. Henry is a big name, but 2023 was not up to his lofty standards. The one thing I’ll say in Henry’s favor is that his offense made things a hell of a lot tougher for him than Mostert’s did. But I still think you’ve got to give it to the guy with better production and efficiency."}
{"text": "I want to live in a timeline where people understand stats don't exist in a vacuum, especially in football of all sports. You give prime randy moss zack wilson as his qb and his stats will look mediocre, does that mean randy is less good?  Obviously not, the same applies to every position in football except maybe kickers."}
{"text": "I can't stress how much i hate listening to Jonathan Vilma."}
{"text": "do you guys even really think of Bak as on the team anymore? i’m not super familiar with the packers media and stuff but i feel like he hasn’t been on the field a lot for a couple years now"}
{"text": "What happened to Woolen? Dude had a great rookie year right? But then was benched for tackling issues or something? Just curious if there was more to it."}
{"text": "Thinking Derrick Henry above Goff is obviously incorrect? Weird opinion and really highlights some of the bias present in those that were a ‘part’ of this comment section.\n\nNot sure why I assumed these would be good comments. The population that commented is the same people that have always had large biases for and against certain players. I figured you all were going to do something incredibly advanced with arguments but very disappointed to see how bad these have been so far.\n\nReddit is what it is. A bunch of people who have inflated view of self and aren’t really better than any random average person in terms of knowledge or know how."}
{"text": "It’s absolutely insane to me that someone can say with confidence that Jordan Love can’t progress past his first read. Is this because you saw a stat that says he throws to his first read a lot but missed the part where most great QBs do the same?\n\nI know I’ll be ignored because of my flair, but holy hell I cannot fathom how not only did you say this with confidence but people actually agreed with you. Love has faults, without a doubt. Not being able to get through progressions is absolutely not one of them."}
{"text": "Guy got so drunk on Thanksgiving he doesn't remember anything after the Raiders game."}
{"text": "Holy homer bias take"}
{"text": "i wouldnt have love this high but comparing him to 2015 bridgewater is crazy. love had more td passes in his last 8 games than bridgewater had all of 2015.  \nedit: i wouldnt have love at all on this list tbh  \nhard to say someone is top 100 with how bad of a first half of the year he had"}
{"text": "Tbh this is exactly how I felt when my division rival’s young, shiny, impressive-looking cheap QB looked while my team had an expensive, known-quantity, middle-aged QB whose ceiling we’ve seen for many years.\n\nYou learn to adjust. Deep breaths."}
{"text": "[deleted]"}
{"text": "Tell me you don't know what you're talking about without telling me you don't know what you're talking about\n\n\n\n\n\n\n\n\nLove isnt perfect but to say he can't progress past his first read means you either didn't watch a lot of packers games (including the Thanksgiving game,) or you're being purposefully obtuse. "}
{"text": "Tell em bro"}
{"text": "Yeah but he had a 6 game stretch where he looked above average"}
{"text": "I haven’t been offended in a long time, maybe since I found out Kindle Vildor’s facemask existed"}
{"text": "I’m sure Quinn Ewers will take them over the top. After all, Goff made Josh Reynolds drop every crucial pass in the NFC championship, and was responsible for the defense blowing the lead."}
{"text": "What will it take for this subreddit to accept Goff is one of the best QBs in the NFL? The comparisons in this thread to Derek Carr and 36 year old Alex Smith are insulting honestly"}
{"text": "I may have to agree mike…"}
{"text": "I’ve been saying this for years!"}
{"text": "?? Where did this come from?"}
{"text": "lol"}
{"text": "He placed higher than the three guys who got more DPOY votes than him, if it's any consolation."}
{"text": "This list is for the 2023 season, so players are listed on their 2023 teams."}
{"text": "I would argue that Tae's box score stats were far from amazing this year. He managed to put up mediocre volume stats, but on terrible efficiency. However, the context surrounding the offense around him is important, as you noted! Without that, he probably would have been unranked.\n\n\nWhat's interesting to me is that very same context could be used to make the case for Love over Goff. Goff had a great playcaller and was surrounded by talent at every position. Love had some solid players around him, but I think we can all agree it was nothing like Detroit. The receivers especially, were all young, and it makes some sense that it took them time to get on the same page."}
{"text": "A few contributing factors: he's an often injured 32 year old with only one year left on his contract "}
{"text": "My man living in 2022"}
{"text": "I mean it's probably the right call. Hurts wasn't exactly a worldbeater last year."}
{"text": "Eh, I’ll be honest. I love Keenan and he had a monster year before we shut it down but I’d for sure take Davante over him as a player."}
{"text": "Yes, the highest (and lowest) rank is removed, so that rank ultimately wasn't used in the calculations"}
{"text": "Wow they sound really cool and right"}
{"text": "Its not that. How is Jared Goff 80, when Davante Adams is 76?\n\n  \nedit: all joking aside, has Goff *really never been top 100 before???* The dude was getting MVP votes at one point."}
{"text": "I wouldn’t say it went under the radar. I think people just generally don’t understand how unprecedented the Packers’ youth on offense was, so they attribute a lot more of the team’s early struggles to Love than are deserved."}
{"text": "Quincy is a god"}
{"text": "Yeah I don’t think this will keep any lions fans up at night. I’m honestly fine with loves placement. But 80 is simply far too low for Goff especially cause he was a top 5 qb last year (at least in my opinion)."}
{"text": "What does this mean?"}
{"text": "Yeah, and we've seen it before with him. Early in his career when he had 700+ yards in 8 games before breaking, for example.\n\nAt least you're finally done with the Lynn/Staley carousel."}
{"text": "Would've loved to have kept him, but honestly looking forward to seeing how he'll do on the Bears."}
{"text": "So 2015 and 2016 never happened? https://www.pro-football-reference.com/players/A/AlleKe00.htm"}
{"text": "Goff also had a higher On Target Throw % (80.3 to Love's 76.6) while having a higher pressure rate (22% to Love's 18.8%) and a shorter average pocket (2.3 seconds to Love's 2.5 seconds), and a higher ANY/A (6.87 to Love's 6.32)"}
{"text": "Yes, if you also factor in the other stats Goff was better, and downgrade Love for his horrible play during the first 9 games of the season."}
{"text": "Sir this is a \"Wins is a QB stat\" thread, we need you to leave."}
{"text": "Username checks out"}
{"text": "Why would I waste time fighting with such a nobody team"}
{"text": "Those are both valid points, but I think it’s naive to imply the name on the back of the jersey didn’t factor in as well."}
{"text": "This is a very shallow description if that’s what the list is going to be based off of. \n\nI do think Henry > Mostert (quite easily) but you can’t just further the point by where PFF ranked the Titans OL. They were definitely better in 2023 than in 2022 (where they were last in consensus) but in both of these seasons, the run blocking grades were pretty average. In 2023, it was 18th in the league. Aaron Brewer is the biggest victim of being one-sided. Terrible in Pass Pro, but pretty good in Run Blocking. Much like the Titans OL. \n\nAnd Achane has the talent and speed, but at least compared to Mostert, his workload was very light, and the boxes/blocking he saw early in the season were very favorable. He dropped after the return from injury. \n\nI just don’t these rankings will be broad. Especially since Scherff (of all people) was given an honorable mention and that James Cook was top 100. But, we’ll probably not see Lawrence or Etienne make the top 100 and I find that to be pretty asinine (2 guys that I find to be top 10 their position)."}
{"text": "I think if Derrick Henry had put up Mosterts stats, the rankers would have had him in the top 30.\n\nThere's so much internal bias from previous seasons."}
{"text": "He seemed to be broadcasting every packers game for several weeks. I was about to put that shit on mute just to avoid the aneurysms he gave me"}
{"text": "Well he’s not on the team anymore. But he played 11 games in 2022 and was supposed to be healthy going into 2023. Instead he played the first game and was never seen again."}
{"text": "Bakh played really well in in the 11 games that he played in 2022. He was still kinda rehabing from his ACL injury from 2020 but by the middle of the season he was essentially Bakhtiari of old. The Jets were really pushing us packaging him with Aaron but the feeling was giving them multiple potential All-Pro players was too much. He was slated to be the honest full time starter in 2023 but got hurt in the first week. After that people were looking at his contract and were like \"ok yeah he's probably gonna get cut in the offseason\" but that was not the case entering Chicago last season\n\nI think it's fair to say that losing him wasn't quite as big of a deal as it could have been because a) the Packers had experience working with a Bakhtiari-less OL with much of the same linemen and b) those OL were on the whole pretty good, especially Jenkins who made our Top 100 list. But Bakh was still seen as a very important player to have on the team and could have been a real difference maker. Yeah the Packers OL as a unit graded alright, but man I wish we had a healthy Bakh on the field instead of Sean Rhyan or a Yosh Nijman at times. It was a meaningful loss and something not completely forseen this time last year"}
{"text": "Well we sure were paying him like he was last year. No hate injuries suck, but it was frustrating as a fan"}
{"text": "The story as I've heard it is that he got hurt and it made him shy away from contact.  Hopefully he can shake that off because he's an absolute freak athlete but I guess we'll see."}
{"text": "Woolen graded out as the best corner in man coverage, according to PFF, in the past season.   \n\nHis problem is that people noticed his weakness (tackling) and that we rarely played man coverage ([13% man, 84% zone](https://x.com/fball_insights/status/1734674664260063614))   \n\nSo he has very high highs but his weakness needs protection from being exposed.   \n\nI think Mike McDonald gonna cook something up for him, I am sure he loves having a talent like that in his ranks"}
{"text": "I’ve had this conversation with Lions fans before. Love over Goff is a pretty standard take from people who watch tape and put the analytics into context. But you’re not going to convince them of that."}
{"text": "It was by far his biggest flaw visible in every second of tape of him at Utah State and has only slightly improved after years in the NFL. Love has strengths, but quickly progressing through his reads is still a major weakness that Goff just doesn't have"}
{"text": "You don't think the guy that finished 2nd in the entire NFL in passing tds and was a garbage time incompletion away from a perfect passer rating in a playoff game is top 100?"}
{"text": "Yeah Goff taking us to the NFCCG and coming off a top ten season is exactly like Derek Carr floundering for years"}
{"text": "Can you explain to me how this is a bad thing? Overall, Goff had 16 turnovers and Love only had 14. So what you’re saying is that Love almost never turned it over unless he was behind late and trying to mount a comeback on a team with literally zero veteran WRs or TEs to lean on in crunch time. How is that a bad thing, exactly? And again, he had two *fewer* turnovers than Goff on the year, and four more TDs. And it’s not like he failed every time in those situations. He had 3 game winning drives and 2 4th quarter comebacks on the year, numbers that are identical to Goff. If that’s your best anti-Love argument, I think you’re making a pretty damn good case **for** him."}
{"text": "4; LVR, DEN, PIT, SF.\n\nStill not great, but not quite as bad as you remembered. Vs. LVR/DEN was definitely the low point in our season and he was far from the only one fucking up in that stretch.\n\nPIT really felt like the turning point; even with a few mistakes it really felt like he & the receivers were finally starting to put it together more consistently."}
{"text": "Jordan Love 2nd half of season rankings:\n\n- Passing TDs (18) – #1\n\n- TDs (20) – T-#1\n\n- Passing yards (2,238) – #1\n\n- Completions (183) – #3\n\nAll that with just 1 INT and a playoff game where he was 1 dropped pass from a perfect passer rating. \n\nI guess Elite is technically above average"}
{"text": "For real they act like he’s 35 years old. He’s 29."}
{"text": "Because he simply isn't one of the best QBs. He's a mid level starter in the best situation in the league. He's not any better than KC Alex Smith was."}
{"text": "Goff is better than Bridgewater, A. Smith, Carr, Dalton,...\n\nHe is no top 3 QB, but isn't average either.\n\nWhere is Love in all of that, nobody knows yet. These are mostly speculations about him, what will he be."}
{"text": "Carr got 6 MVP votes one year (2017). I think Goff is better than Carr right now, but I don't think comparisons to Carr or Smith are terrible. Goff is one of the best QBs in the NFL, but that's not very meaningful without a numeric qualifier, because Tyler Huntley is also one of the best QBs in the NFL (top 50)."}
{"text": "It’s because of the last sentence in your writeup."}
{"text": "Did you watch the games - of course his efficiency stats would be lower when he’s being asked to do more, with worse talent around him, that’s just how efficiency stats tend to work. For the whole season he had a second guy blanketing him, which was fine the year before because the run game was actually working for parts of last season. This year it didn’t work until Jacobs got hurt in November/ December.  dude had a first time play caller who was awful with a rookie Qb / Jimmy G/ Hoyer sharing the job of throwing him the ball. For large parts of the game our rookie play caller would just forget about Tae, which is when our offence struggled the most, or do the exact opposite of completely force it to him in double teams when it made no sense. I just don’t think his performance last season warranted a 60 place drop in the list, when he was really good last season, and still put up great numbers, and completely passed the eye test of being a true number 1 Wr. I would’ve been fine with a minor drop on the list, maybe 30 spots, but 60 is egregious considering the gaps of talent around him. \n\nI don’t fully disagree with your point on Goff vs Love, Goff defo had the better weapons. I’d argue that Green Bays coach/ play caller are just as strong, maybe a little stronger than the Lions coach/ offensive play caller tho, so I just looked at it as a wash of one guy having better coaching with the other having better weapons to throw to."}
{"text": "This ranking is specific to last year. It does not factor in previous or future seasons.\n\nKeenan put up better numbers in 12.5 games than Davante did in 17. Yes, Keenan had Herbert instead of Jimmy G/O’Connell, but as the writer said, Keenan was also the only competent and consistent weapon on the team."}
{"text": "And unranked does not count at all or how does that work?"}
{"text": "Of course it was Harambe. You really let him keep that thought Pack?"}
{"text": "Goff hasn't received a vote for AP MVP in his career I don't think. He did lead the league in ANY/A in 2017 though."}
{"text": "Goff has been an honorable mention three times; in 2018, 2019, and last season in 2022."}
{"text": "Honestly though would anyone take Henry over Adams?"}
{"text": "He was in the conversation for the first half of 2018, but fell off rather quickly"}
{"text": "If anything he deserved a spot last season. He was *slightly* more statistically productive then IIRC."}
{"text": "I'm surprised he wasn't on there in 2018 and last year honestly, but for the most part his stats have been better than his reputation due to playstyle and situation."}
{"text": "I would assume that Purdy won’t make the top 100 this year and he got a MVP vote as well."}
{"text": "We have have some the exact same rankers as last year leaving him unranked. \n\nWhile i do agree there is a bit of a knock on Goff because we do have a pretty good supporting cast for him but at the same time he is playing good ball.\n\n\nAnd in a bit of a \"down\" year for QB's and positional value at least to some degree taken into account, having him unranked feels a bit crazy. Cus the supporting cast is certainly not all going to get their flowers."}
{"text": "The write up for Jordan Love says it; was thinking that’s the only way Love>Goff, idk kinda a stretch I’ll admit"}
{"text": "He played like 4 or 5 years in a row recently healthy. Essentially his whole injury plague ended after san diego"}
{"text": "I made my peace with him leaving because something had to give cap wise and we signed like 7-8 free agents with the money his trade freed up lol.\n\n  \nI think he'll do well on the Bears assuming Caleb isn't a total dud."}
{"text": "Yea I'll be watching a lot more Bears games this season than I ever have before."}
{"text": "Yeah but I mean most people are pointing to the second half burst he had as to why people are hyped for him. I get it’s a full season but compare those numbers from week 10 onward and I bet love is winning all of those comparisons (maybe I’m wrong, but I’d honestly be shocked). Not a massive sample size, but I mean he only has 1 year of playing time to look at."}
{"text": "Having actually watched the games I'd say Love had one, maybe two bad games, a handful of meh games and then the rest he was really good. He had 7 games with a rating under 100. But you can still mount a brilliant 17-point 4th quarter comeback week 3 and have a \"horrible game\" to those that are simply stat watching."}
{"text": "Ironically QBs wins were what everyone used to point to with Stafford to say he wasn't elite on the Lions so it's kind of funny that it doesn't work with Goff now"}
{"text": "How is what I said fanboy behavior. Their stats were nearly identical. I’m not making that up"}
{"text": "Same here. Let’s go punch the bears some more"}
{"text": "One good year in the last 100 years and lions fans turned into this"}
{"text": "If Henry had put up Mostert's stats, it would have been incredible given the QB carousel and OL woes surrounding him. The context is the difference between the two, and why we don't just compare based on stats."}
{"text": "Even with my severe dislike of Packers I wouldn't wish Jonathan Vilma on y'all. \n\n\nDude is so bad and so fucking biased and gets things wrong a lot. Like I get you'll have a bit of bias towards your former team but at the same time i generally don't think they should be announcers for games involving their former teams."}
{"text": "thank you for the info"}
{"text": "You're using tape from 5 years ago BEFORE his NFL development? Are you high?"}
{"text": "Bro is still talking about college. 5 years ago dawg get over it"}
{"text": "You know that Utah State was 5 years ago, right? And I won’t even get into the football terrorist who coached his final year there. It is flat out inaccurate to claim that Love struggles with his progressions to any significant degree. Does an 8 year veteran with 117 career starts get through his reads better? Sure, I’ll give you that. But Love has plenty of tools that far outpace Goff’s."}
{"text": "He might be a top 10 QB, but that doesn't make him a top 100 player. And I don't even call him a top 10 QB. I think he showed promise the second half of the year."}
{"text": "Derek Carr has more MVP votes than Jared Goff lol"}
{"text": ">How is that a bad thing, exactly? \n\nHow is it a good thing?  Turnovers are bad.  Being down late and needing to make a desperate comeback is bad.  How is this not obvious?"}
{"text": "the int against PIT was as time expired   \nnot saying he played a great game against them but to count it against him specifically cause he threw an interception on the last play is dumb as if somehow his season would have been better if it was incomplete."}
{"text": "[deleted]"}
{"text": "I hold no salt towards the Lions fans at all, was just having some fun in how I remind people he’s coming off an injury he suffered late last year"}
{"text": "Idk. Considering multiple kneecaps have been claimed, I think the salt is fine."}
{"text": "Definitely agree with you that the context is important. There's just so much receiver talent in the league right now, it's hard to stay high on these kinds of lists. Look at the production and efficiency DJ Moore had with Fields at QB, or Amari Cooper with the mess in Cleveland (and Cooper was already ranked, so Adams did make it above him)."}
{"text": "Availability is definitely factored into the rankings. Some rankers factor it in more than others also"}
{"text": "Unranked counts as if you ranked the player 140th"}
{"text": "Pretty sure harambe said he originally had him #1 lol"}
{"text": "I may be mistaken. I remember him being in the MVP race at one point. At that point he wasn't on my team, and I thought he was the most overrated player in the league, and it bother me that he was getting preference over players like Stafford.\n\nHe's on my team now, so this is the year. Goff for MVP."}
{"text": "Honorable mention in 2018 is wild. He had near MVP numbers"}
{"text": "He was right behind Mahomes and Brees after the Chiefs game! Then the Lions and Bears games happened.\n\nHe definitely should have still made the top 100, though."}
{"text": "That’s a really weird assumption to make"}
{"text": ">at the same time he is playing good ball.\n\nPeople use \"system QB\" as a knock, but Goff with an OC that doesnt go \"maybe we should fuck and chuck every passing attempt\" is a top end QB.  \n\nHe's not the all downfield all the time QB, but with motion support?   Dude is really good."}
{"text": "Amon Ra and LaPorta will both be in the top 50, as will at least one or two of the OL. They’ll get their flowers in these rankings"}
{"text": "Minus 2022, of course.\n\nYes, he's never missed an entire season (I'm counting getting injured in week 1 as missing the entire season) since the team moved to LA."}
{"text": "QB Winz is just a crutch people use when they can't handle nuance QB discussion"}
{"text": "QB winz is a braindead argument to make in any context really"}
{"text": "It's the Browns all over again"}
{"text": "Stated another way - if Miami had signed Henry during the offseason and put up the exact same numbers as Mostert did, the rankers would have had him in the top 30.\n\nCase in point - James Conner had very similar OL Run Block grades & bad QB situation, put up nearly a full additional yard per carry and more yards per game.  I'll be surprised if he was ranked at all, much less in the same ballpark as Henry."}
{"text": "Absolutely.\n \nI’d feel the exact same way if I was watching a Lions game and was subjected to him."}
{"text": "No problem! He actually had another surgery this offseason and is hoping that fixes his issues. I hope the guy gets another chance. He’s still only 32 and we’ve seen tackles excel late into their 30s. And he was still fantastic whenever he managed to make it onto the field. There’s some small chance that a team picks him up in training camp for cheap and gets a massive steal. But it won’t be the Packers."}
{"text": "Utah State being 5 years ago doesn't mean it isn't still his biggest flaw, it was a huge part of the reason he struggled for half of the season. The dude locks onto his first target, whether you accept that or not"}
{"text": "He was statistically the best QB in the NFL after week 9, that's a lot more than showed promise lmao"}
{"text": "So what?  Irrelevant"}
{"text": "So talking about flaws Jordan Love has had for 5 years is awful because 5 years is such a long time but somehow Carr's 2017 season means Love is better than Goff?"}
{"text": "Because Love only had 14 turnovers on the entire season. This thread is all about comparing him to Goff, who had 2 **more** TOs than Love (16) and also 4 fewer total TDs (36 to 32). In the context of a player who turned it over less than once a game in his first season starting, I think it’s a green flag that a decent percentage of the turnovers he did have came trailing late in games. That means when he doesn’t have to force things he’s extremely careful with the ball. Aaron Rodgers had a very similar issue his first year starting and won only 6 games with a better team around him. I think that turned out ok."}
{"text": "Because the score is a team stat and a last drive when you’re down TO isn’t as damning as others? It’s you trying to pry victory out of defeat with hero ball. Sometimes it works often it fails but it’s not a huge flaw for the QB as much as throwing ints at other times, which Goff was more likely to do."}
{"text": "I understand your point; I just didn't want to get too down into caveats when I was just trying to correct the record with the actual numbers.\n\nI still think he earns a bit of a black mark for the end of that game because his possession before that is when he threw his other INT in that game; same score and almost identical down/distance/field position just with 3:32 left instead of 0:03. If he just threw incompletions instead at the end of those drives we could have kicked two field goals to win the game."}
{"text": "And in fact, Love is the only QB to ever fail to complete a game winning drive in the 4th quarter. Sad!"}
{"text": "Don’t disagree. In fact I have salt of my own lol. They almost took out Dak in week 17."}
{"text": "Sure but what I’m saying is that Keenan’s season was better than Davante’s season even when you *don’t* consider how many games they played. If Keenan played the last 5 games and did not catch a single pass in any of them, he should still be ranked above Davante."}
{"text": "Thanks Krimzy, appreciate ya."}
{"text": "Doesn’t shock me at all."}
{"text": "Being in the MVP race/talks and actually getting votes are different things"}
{"text": "Yeah but everyone saw that it wasn't him."}
{"text": "You can't have any discussion with a NFCN fan with a Packers flair they just downvote"}
{"text": "Yet it's heavily implied here since the only stat Goff has on Love is wins and an extra 20 yards a game."}
{"text": "Oh hell yeah, you already know we'd be praising Henry and use it as an excuse to not rank Tua. Fair point.\n\nAnd I think your example with Conner is valid as well."}
{"text": "he kinda sounds like our center Frank Ragnow, who’s pretty much got a permanent toe injury"}
{"text": "You sound like Billy Madison talking about business ethics"}
{"text": "Goff can’t throw the ball without a squeaky clean pocket and thats now not when he was a sophomore in college"}
{"text": "Nope, that's exactly what showing promise is. Let's see how he does next year before putting him in the HoF."}
{"text": "Just feels weird to suggest that Carr has always been some scrub (floundering for years) as if Goff has routinely been better. They've probably had similar peaks, in fact I'd say Carr's best season is better than Goff's. \n\nGoff was run out of town and the Rams practically paid to get rid of him. He's had a resurgence with a stacked Lions roster. He's been good. Definitely don't wanna take that from him. But a Lions fan acting high and mighty as if Detroit Goff is substantially better than Oakland Carr seems a little silly at this point, to me. \n\n/u/imposingthanos makes a pretty good point, imo. At least a fair comparison anyway."}
{"text": "I don't know what you're on about. I don't think anything about Carr means anything about Love and Goff. Not sure what you're twisting at here. \n\nLove was a first year starter this year. Goff is a seven year starter (8 if you wanna count him starting 7 games his rookie year). Love threw more touchdowns, less picks and had four hundred less yards. He ran for 220 more yards and had two more rushing touchdowns. So on the whole they had similar yardage output, Love had four more total touchdowns and less total turnovers. \n\nGoff had a 97 passer rating. Love had a 96 passer rating. They had similar seasons. Love did it in his first year as a starting QB with the youngest roster in the league and far less talent. The Lions meanwhile are pretty stacked on offense with Amon-Ra, LaPorta, Sewell, Gibbs. Who would each be the best player on the Packers offense (maybe not Gibbs but he wouldn't be worse than 3rd). Even each guy's advanced numbers are pretty identical to one another.\n\nSo yeah it doesn't seem crazy to me that Love is better than Goff in 2023. Because Love put up about the same-if-not-slightly-better numbers with a significantly worse supporting cast. And again did it in his first year playing while Goff has had seven or eight as a starter. Love also was significantly better than Goff in the final eight games of the year by just about whatever metric you wanna choose. \n\nI don't think anything about Carr means anything about Love in relation to Goff. Weird take. I just don't think that Goff has been substantially better than Carr throughout their respective careers. Carr's peak was probably better than Goff's. Goff is having a resurgence on a good team and that's good for him. He was good last year. Check my ranker sheet and you'll see I had Goff ranked ahead of Love. But it's weird to act like this is some travesty. Or that Goff is somehow an upper echelon QB and not a known quantity, middle-aged solid but not amazing QB. Like /u/imposingthanos pointed out to start with."}
{"text": "Yeah that's still not great if he threw a pick the drive before.\nI just don't like boiling it all down to how many games ended with a turnover. As if it's better to get blown out like in week 4 or turn over on downs like in week 2."}
{"text": "THE MAN MUST BE STOPPED!"}
{"text": "Boy did I learn that lesson last year."}
{"text": "Valid take as long as you weren't in the Purdy for MVP group last season . . ."}
{"text": "Dudes never had a bad season in his career but it wasn't him lol. \n\n4000 yards and 25 touchdowns is an average season for Goff. He was underrated then and still is."}
{"text": "Yeah that’s not a bad comparison. I don’t remember exactly what surgery he got now, but he did throw a little shade at the Packers by saying he should have gotten it right when he was hurt. Hopefully it fixes the issue now, but who knows."}
{"text": "That was actually Eric Gordon, the guy who was trying to take over the business instead of Billy Madison, who had the business ethics question and pulled the gun when he couldn't answer."}
{"text": "*leans in for a kiss*"}
{"text": "Like i don't really care too much  about the discussion you are having with the other dude about Love vs Goff or whatever. \n\n> The Lions meanwhile are pretty stacked on offense with Amon-Ra, LaPorta, Sewell, Gibbs.\n\n\n\nI would like to mention at least that i do thinkthat it's a bit unfair to mention LaPorta and Gibbs when they were rookies. We didn't know how they'd end up doing. \n\n\nSidenote, I like Reed and Wicks and both your TE's."}
{"text": "It wasn’t Kerby Joseph though. It was Aidan Hutchinson on a near hip drop tackle that only didn’t connect because our right tackle caught Dak in his fall."}
